1) Написать программу вычисляющую площадь треугольника по трём сторонам.
#include <stdio.h> 
#include <math.h> 
#include <locale.h> 
 
int main() 
{ 
    setlocale(0, "rus"); 
    float a, b, c, p, s; 
    printf("Введите стороны треугольника:\n"); 
    scanf("%f%f%f", &a, &b, &c);
    if ((a <= 0) || (b <= 0) || (c <= 0)) printf(" Стороны должны быть больше 0");
    else
    {
        if ((a + b <= c) || (b + c <= a) || (a + c <= b)) printf(" Сумма двух сторон треугольника должно быть больше третьей");
        else
        { 
            p = (a + b + c) / 2;  
            s = sqrt (p * (p - a) * (p - b) * (p - c)); 
            printf("p = %.2f\n", p);  
            printf("s = %.2f\n", s);  
        }
    }
    return 0;  
}
2) Дать оценку качества кода программы.
4
Программа сработает, если пользователь введёт соответствующие требованиям значения. В противном случае оно не будет работать.
Код довольно короткий, логичный и понятный. Хотя есть строки, и без которых программа могла бы работать также.